{
    "nieuws":
    [
        {
            "titel": "Pokémon Ultra Sun and Moon’s photo mode is cute as heck",
            "id": 212,
            "datum": "18/08/2017 • 02:10",
            "categorieen": ["Pokemon","Nintendo"],
            "samenvatting": "We’re getting plenty of Pokémon Ultra Sun and Ultra Moon news today, including a look at one of the games’ new features. The Alola region has installed some photography centers — or, excuse me, Photo Clubs — since last year’s Sun and Moon, so players can take some nice portraits with their best Pokémon friends.",
            "body": "<p>We’re getting plenty of Pokémon Ultra Sun and Ultra Moon news today, including a look at one of the games’ new features. The Alola region has installed some photography centers — or, excuse me, Photo Clubs — since last year’s Sun and Moon, so players can take some nice portraits with their best Pokémon friends.</p><p>Game Informer has the exclusive, which it showed off in a gameplay video. The photography feature has stickers, different backgrounds, outfits to try on and various poses for players and Pokémon to do.</p><p>It’s ... ridiculous, obviously. But hopefully it will redeem Popplio, the much-maligned starter who looks super cute in the mode’s debut footage. The whole thing reminds us of an expanded version of Pokémon X and Y’s Trainer PR mode, which let players take self-portraits and even construct some truly weird videos.</p><p>We’ll soon see just how comprehensive Ultra Sun and Ultra Moon’s photo mode is — there are still a lot of unanswered questions about the Nintendo 3DS games, after all. Please remember to share your photos with us when the games launch on Nov. 17.</p>",
            "afbeeldingl": "pokemon.png",
            "afbeeldings": "pokemon-1.png"
        },
        {
            "titel": "Splatoon 2’s next Splatfest asks one of the hardest questions",
            "id": 210,
            "datum": "22/05/2017 • 08:43",
            "categorieen": ["Nintendo","Splatoon"],
            "samenvatting": "Would you rather be able to fly or turn invisible? That’s one of the toughest hypotheticals known to man, and Nintendo is throwing it in Splatoon 2 players’ faces with the game’s next Splatfest.",
            "body": "<p>Would you rather be able to fly or turn invisible? That’s one of the toughest hypotheticals known to man, and Nintendo is throwing it in Splatoon 2 players’ faces with the game’s next Splatfest.</p><p>Since Nintendo revealed the upcoming Splatfest’s teams earlier today, the masses have weighed in. Flight is the obvious pick here, according to the majority of Splatoon fans — defying the laws of gravity? Hell yes, they say. Even if that means supporting the much-hated Splatfest host Pearl, Team Flight members are holding fast.</p><p>Flight has long proven to be the popular answer to this age-old debate, as discussed on an old episode of This American Life. In a segment on the radio show, contributor John Hodgman found that most people are down to fly — “Flight is the hero, selfless and confident and unashamed,” he says.</p><p>But invisibility strikes me as a much more practical choice. You can get work done without interruptions. You can go anywhere and not be bothered. You don’t have to worry about how your hair looks or what you’re wearing or if there’s chocolate on your face. It sounds perfect.</p><p>Flight, meanwhile, could be totally life-threatening. You know what they say about flying too close to the sun, right?</p><p>Of course, Nintendo hasn’t clarified the limitations of flight and invisibility in this paradigm. Maybe you can only fly so high. Maybe you have to be totally naked for the invisibility to work properly. Maybe they’re both terrible options, as some have suggested.</p><p>Who knows? Nintendo hasn’t said how these powers work, but we’ve asked. We’ll keep you posted.</p><p>Although I consistently pick the unpopular choice in these Splatfests — I was Team Mayo last time, and Team Cake before that — it helps that fan-favorite idol Marina is repping invisibility in this round. We’ll see if people feel obligated to go with the superpower as a means of showing support for their best girl ... not that that helped out big-time loser Team Ketchup much in the last Splatfest.</p><p>You have just two weeks to choose a side before defending your team in as many matches of Turf War as you can. Pick wisely.</p>",
            "afbeeldingl": "splatoon-1.jpg",
            "afbeeldings": "splatoon.jpg"
        },
        {
            "titel": "Nintendo vs. Sega: The battle over being cool",
            "id": 198,
            "datum": "22/08/2017 • 01:06",
            "categorieen": ["Sega","Nintendo"],
            "samenvatting": "Nintendo and Sega. Mario and Sonic. Blast processing and FX chips. The two companies, once blood rivals and now amicable business partners, spent the 1990s fighting for the favor and free time of a generation.",
            "body": "<p>Nintendo and Sega. Mario and Sonic. Blast processing and FX chips. The two companies, once blood rivals and now amicable business partners, spent the 1990s fighting for the favor and free time of a generation.</p><p>The conflict is the stuff of nerdy legend, with an upcoming movie adaptation in the works. But we often miss the point when we talk about Nintendo and Sega, especially in retrospect.</p><p>It’s not just about technology, characters or franchises, but an overall split in philosophy that drives these companies to this day: Nintendo wants to be timeless, and Sega wants to be cool.</p><h2>DESIGNING COOL</h2><p>What’s cool to me may not be cool to you, so for the sake of this article, let’s set up a working definition. Cool is: The act of emulating or creating something based on contemporary trends, interests and art.</p><p>It’s trying to be of-the-moment, the attempt of finding out what The Kids are up to these days. If you succeed, you look like you understand the reality of current pop culture and how to tap into it. If you fail, you look like Acclaim.</p><p>In 2002, riding the lucrative wave of action sports titles kicked off by Tony Hawk’s Pro Skater in 1999, that company decided the world needed a mix of extreme sports and full-frontal nudity.</p><p>The resulting title, BMX XXX, appealed to no one, not even fans of raunchy humor like Jackass, presumably the target demographic. The game came off as a cynical appeal to teenage libido, and even contributed to the company’s bankruptcy in 2004. Not cool.</p><p>When we talk about pursuing cool, I’m not talking about external factors, like marketing or packaging — I grew up in Canada, and both Sega and Nintendo were dedicated to pursuing an Xtreme 1990s idea of coolness, to mixed results. I’m talking about embracing (or eschewing) what was hot at the time from a game design standpoint. We’re talking about the art itself, not the wrapper around it.</p><p>Sega has pursued its idea of cool since Sonic the Hedgehog first wagged a finger and tapped his foot impatiently at the player, and that chase has always defined its games.</p><p>The company had its fair share of misfires — Knuckles Chaotix was a prime example of “animals with attitude” gone horribly wrong — but Sega has always strived to make games that emulated what was cool and interesting in that moment in time. Comix Zone, for instance, was the most 1990s-looking take on comics imaginable.</p><p>It’s also interesting that Skitchin’ was a Genesis exclusive. Sega’s consoles often seemed to take advantage of the times, with the side-effect of often being bound by them.</p><p>Nintendo, on the other hand, has always seemed to be free from the burden of societal trends, taking cues and inspiration for its titles from older art forms and nature itself. The result has been a body of work that rarely, if ever, mirrors current pop culture. It’s game design that was built to stand on its own, without a wave of cultural awareness pushing it forward.</p><p>So if Nintendo didn’t care about being cool, what was it interested in?</p><h2>NINTENDO DITCHED COOL FOR TIMELESSNESS</h2><p>Nintendo once had a habit of framing its main franchises as other types of stories or experiences. Super Mario Bros. 2 is an extended dream sequence with the trappings of a silent film; complete with explanatory title cards, pulled-back curtains on the character select screen and music inspired by ragtime.</p><p>Super Mario Bros. 3, however, goes full stage play, with Mario and Luigi jumping across blocks that are bolted into place like literal set pieces. They finish each level by exiting stage left.</p><p>From presentation to soundtrack — Koji Kondo’s iconic Mario Bros. theme has strong influences of both jazz and calypso, for instance — Nintendo’s games are rarely connected to a single influence or point in time. These design elements are too broad, pulling inspiration from too many places.</p><p>And then there was Sega.</p><p>Sega, who released Streets of Rage, one of the first (if not the first) video games to feature an EDM-inspired soundtrack in 1991.</p><p>Sega, who (allegedly) brought in Michael Jackson to consult on the soundtrack for Sonic the Hedgehog 3. He allegedly worked on the Carnival Night Zone tracks, and the end credits theme may be the inspiration for “Stranger In Moscow.”</p><p>What the Sega-Nintendo Wars repeatedly demonstrated was the remarkable differences between the ways the two companies sought to appease a mass audience and win market share from each other.</p><p>Nintendo’s philosophy of creating games that appeal to wider concepts and feelings (like the storybook aesthetic of Yoshi’s Island and Yoshi’s Story) defined its creative output throughout the 1990s.</p><p>Meanwhile, Sega was always searching for ways to incorporate the new hotness into its games. Whether that took the form of Sonic and his very 1990s-attitude animal friends, or by pushing the envelope of public opinion by publishing taboo titles like Night Trap, the company used its games library to try to tap into the pulse of the era. Sega wanted to be current and edgy, not timeless.</p><p>These divergent ways of thought were most pronounced when comparing the same third-party games across both platforms. The original Mortal Kombat was ported to the Genesis in all its bloody glory, while Nintendo demanded massive changes for the SNES version. The censored edition of the game is a bizarre delight, with the characters ejecting fountains of grey “sweat” with each punch, and fatalities being removed entirely in favor of glitchy “finishing bonuses.”</p><p>The SNES version of Aladdin had better level design and music, while the Genesis version had vastly superior Disney-quality animation. Plus, the Genesis gave Aladdin a sword to use. Swords are objectively cool.</p><p>In the case of Jurassic Park, the differences between the versions border on the surreal. The Genesis version presents a movie-accurate story, and the ability to play as both Grant and a velociraptor. The SNES version splits its gameplay between top-down adventure gameplay and a bloodless Doom clone where you shoot at dinosaurs with tasers and exploding bolos.</p><h2>FOLLOW THE HEDGEHOG</h2><p>Sonic led the way, whatever Sega was doing.</p><p>Sega was struggling to define itself past the 16-bit era by the mid-1990s. While the Super Nintendo and Sega Genesis were relatively similar in terms of power and types of games offered, there was no precedent for the jump to 3D gaming. Both companies had to figure things out for themselves.</p><p>So while Nintendo embraced 360-degree movement and camera control with Super Mario 64 in 1996, Sega split the difference with Sonic 3D Blast, which featured 2D sprites on an isometric playing field, but switched to a polygonal Sonic during bonus stages. It was weird. But sometimes, weird works. And late-1990s Sega had weirdness to spare and nothing to lose.</p><p></p>",
            "body": "<p>Nintendo and Sega. Mario and Sonic. Blast processing and FX chips. The two companies, once blood rivals and now amicable business partners, spent the 1990s fighting for the favor and free time of a generation.</p><p>The conflict is the stuff of nerdy legend, with an upcoming movie adaptation in the works. But we often miss the point when we talk about Nintendo and Sega, especially in retrospect.</p><p>It’s not just about technology, characters or franchises, but an overall split in philosophy that drives these companies to this day: Nintendo wants to be timeless, and Sega wants to be cool.</p><h2>DESIGNING COOL</h2><p>What’s cool to me may not be cool to you, so for the sake of this article, let’s set up a working definition. Cool is: The act of emulating or creating something based on contemporary trends, interests and art.</p><p>It’s trying to be of-the-moment, the attempt of finding out what The Kids are up to these days. If you succeed, you look like you understand the reality of current pop culture and how to tap into it. If you fail, you look like Acclaim.</p><p>In 2002, riding the lucrative wave of action sports titles kicked off by Tony Hawk’s Pro Skater in 1999, that company decided the world needed a mix of extreme sports and full-frontal nudity.</p><p>The resulting title, BMX XXX, appealed to no one, not even fans of raunchy humor like Jackass, presumably the target demographic. The game came off as a cynical appeal to teenage libido, and even contributed to the company’s bankruptcy in 2004. Not cool.</p><p>When we talk about pursuing cool, I’m not talking about external factors, like marketing or packaging — I grew up in Canada, and both Sega and Nintendo were dedicated to pursuing an Xtreme 1990s idea of coolness, to mixed results. I’m talking about embracing (or eschewing) what was hot at the time from a game design standpoint. We’re talking about the art itself, not the wrapper around it.</p><p>Sega has pursued its idea of cool since Sonic the Hedgehog first wagged a finger and tapped his foot impatiently at the player, and that chase has always defined its games.</p><p>The company had its fair share of misfires — Knuckles Chaotix was a prime example of “animals with attitude” gone horribly wrong — but Sega has always strived to make games that emulated what was cool and interesting in that moment in time. Comix Zone, for instance, was the most 1990s-looking take on comics imaginable.</p><p>It’s also interesting that Skitchin’ was a Genesis exclusive. Sega’s consoles often seemed to take advantage of the times, with the side-effect of often being bound by them.</p><p>Nintendo, on the other hand, has always seemed to be free from the burden of societal trends, taking cues and inspiration for its titles from older art forms and nature itself. The result has been a body of work that rarely, if ever, mirrors current pop culture. It’s game design that was built to stand on its own, without a wave of cultural awareness pushing it forward.</p><p>So if Nintendo didn’t care about being cool, what was it interested in?</p><h2>NINTENDO DITCHED COOL FOR TIMELESSNESS</h2><p>Nintendo once had a habit of framing its main franchises as other types of stories or experiences. Super Mario Bros. 2 is an extended dream sequence with the trappings of a silent film; complete with explanatory title cards, pulled-back curtains on the character select screen and music inspired by ragtime.</p><p>Super Mario Bros. 3, however, goes full stage play, with Mario and Luigi jumping across blocks that are bolted into place like literal set pieces. They finish each level by exiting stage left.</p><p>From presentation to soundtrack — Koji Kondo’s iconic Mario Bros. theme has strong influences of both jazz and calypso, for instance — Nintendo’s games are rarely connected to a single influence or point in time. These design elements are too broad, pulling inspiration from too many places.</p><p>And then there was Sega.</p><p>Sega, who released Streets of Rage, one of the first (if not the first) video games to feature an EDM-inspired soundtrack in 1991.</p><p>Sega, who (allegedly) brought in Michael Jackson to consult on the soundtrack for Sonic the Hedgehog 3. He allegedly worked on the Carnival Night Zone tracks, and the end credits theme may be the inspiration for “Stranger In Moscow.”</p><p>What the Sega-Nintendo Wars repeatedly demonstrated was the remarkable differences between the ways the two companies sought to appease a mass audience and win market share from each other.</p><p>Nintendo’s philosophy of creating games that appeal to wider concepts and feelings (like the storybook aesthetic of Yoshi’s Island and Yoshi’s Story) defined its creative output throughout the 1990s.</p><p>Meanwhile, Sega was always searching for ways to incorporate the new hotness into its games. Whether that took the form of Sonic and his very 1990s-attitude animal friends, or by pushing the envelope of public opinion by publishing taboo titles like Night Trap, the company used its games library to try to tap into the pulse of the era. Sega wanted to be current and edgy, not timeless.</p><p>These divergent ways of thought were most pronounced when comparing the same third-party games across both platforms. The original Mortal Kombat was ported to the Genesis in all its bloody glory, while Nintendo demanded massive changes for the SNES version. The censored edition of the game is a bizarre delight, with the characters ejecting fountains of grey “sweat” with each punch, and fatalities being removed entirely in favor of glitchy “finishing bonuses.”</p><p>The SNES version of Aladdin had better level design and music, while the Genesis version had vastly superior Disney-quality animation. Plus, the Genesis gave Aladdin a sword to use. Swords are objectively cool.</p><p>In the case of Jurassic Park, the differences between the versions border on the surreal. The Genesis version presents a movie-accurate story, and the ability to play as both Grant and a velociraptor. The SNES version splits its gameplay between top-down adventure gameplay and a bloodless Doom clone where you shoot at dinosaurs with tasers and exploding bolos.</p><h2>FOLLOW THE HEDGEHOG</h2><p>Sonic led the way, whatever Sega was doing.</p><p>Sega was struggling to define itself past the 16-bit era by the mid-1990s. While the Super Nintendo and Sega Genesis were relatively similar in terms of power and types of games offered, there was no precedent for the jump to 3D gaming. Both companies had to figure things out for themselves.</p><p>So while Nintendo embraced 360-degree movement and camera control with Super Mario 64 in 1996, Sega split the difference with Sonic 3D Blast, which featured 2D sprites on an isometric playing field, but switched to a polygonal Sonic during bonus stages. It was weird. But sometimes, weird works. And late-1990s Sega had weirdness to spare and nothing to lose.</p><p>Nintendo spent the duration of this generation updating its key franchises to 3D, while also feeling the sting of a lack of third-party developer support for the N64. Facing dismal sales of the Saturn and the eventual release of the Dreamcast, Sega’s master plan was harder to pin down.</p><p>Within a five-year period, it would release the following games:</p><ul><li>A trilogy that started as a dragon-riding rail shooter and ended as a dense JRPG (Panzer Dragoon)</li><li>An attempt to recreate the feeling of flying in a dream, starring a purple androgynous jester (NiGHTS...Into Dreams)</li><li>A rhythm game that borrowed aesthetics from 1960s space-age fiction and featured Michael Jackson in a cameo role (Space Channel 5)</li><li>A martial arts drama that spent the majority of its time meticulously demonstrating the mundane details of late-1980s Japan (Shenmue)</li><li>A love letter to graffiti culture, hip hop and teenage rebellion (Jet Set Radio)</li></ul><p>Not all of them have aged well, but we can still see evidence of a company actively trying new things in the pursuit of cool. It just didn’t know how to get there anymore. This was a shotgun approach that tried a bit of everything, hoping that something would land with the audience. It’s no wonder many of these games became cult classics.</p><p>And then there was Sonic.</p><p>The character had been searching for an identity in the 3D era. Titles like Sonic R and Sonic the Fighters brought him to polygonal life, but they didn’t deliver a full Sonic experience. The 1990s lounge-and-R&B soundtracks of those titles were era-appropriate, but came off as more cheesy than cool.</p><p>In 1999, Sega introduced the world to a new vision of the character in Sonic Adventure but, once again, the company seemed to be presenting all its ideas at once. There were six playable characters, a hub world and fishing mini-games. It’s a game that didn’t know what it wanted to be. The music of Sonic’s world went from MJ-soundalikes to hair metal and charmingly clumsy rap songs.</p><p>So began the “Modern Sonic” era, where the character strayed further from consistent coolness with every misstep.</p><p>But that’s the point: When Sega fails, it’s in the same manner as the way it succeeds. Changing the formula leads to titles like the widely inconsistent Sonic Unleashed, but it can also result in pleasant surprises like the hip-hop-meets-parkour vibe of the Sonic Rush titles.</p><p>Sega is a victim of inconsistency, but it’s rarely guilty of making or publishing boring games. Without Sega’s willingness to try new things, we wouldn’t have had Otogi on the Xbox in 2002. There was a Nintendo DS Sonic RPG made by BioWare in 2008, as well. That’s a sentence that feels weird to even type, but Sonic Chronicles: The Dark Brotherhood was a real game that was released in real life.</p><p>Yet Nintendo seems to be retroactively be learning from this weirdness, and the results are wonderful.</p><h2>OF KIDS AND SQUIDS</h2><p>Nintendo released Splatoon two years ago. From its character design to its soundtrack, it was more modern and relevant than anything the company had ever released. It was cool.</p><p>It also reminded many people of 1990s-era Sega.</p><p>And now there is Arms, another shockingly fresh game from the company that blends concepts relevant right now — the diversity and personality of the cast of Overwatch and the feel and look of a UFC-esque fighting sport — with trademark Nintendo creativity.</p><p>And on the horizon we have Super Mario Odyssey, a game that seems to be striking that perfect balance of enthusiasm from older fans while also generating a healthy amount of dank memes.</p><p>Nintendo has finally managed to marry the timelessness of its franchises with design ideas that are modern and timely by embracing the fact that its own games don’t exist in a vacuum. The results could even be considered cool.</p><p>What happens when all of the classic hallmarks of Zelda are married to a very modern interest in survival mechanics and well-crafted open worlds? Breath of the Wild briefly outsells its own console.</p><h2>WHAT SEGA IS UP TO NOW</h2><p>Sega’s awkward years of brand and franchise reinvention have looped back around as the company has come to discover what’s cool right now: Self-awareness and nostalgia. But very little of that is coming from Sega as a developer.</p><p>Sonic’s Twitter presence is a known (and beloved) entity, and the Sonic Boom TV show has demonstrated a surprising willingness to poke fun at itself and its fans.</p><p>When it comes to Sonic games, Sega seems to be trying to appease both of its biggest fan bases simultaneously with the upcoming Sonic Forces, a 3D title with a fan-friendly character creator, and the newly-released Sonic Mania showcasing the interesting move of allowing a group of fans and developers to help create a new entry in the franchise.</p><p>From any other publisher, this would be a game-changer. But when compared to Sega’s history of trying new things and chasing trends, it’s par for the course. With the ongoing debate between the merits of fan-created tribute projects and a developer’s right to protect its intellectual property, what could be cooler than just letting fans make the retro sequel of their dreams? And the critics seem to agree.</p><p>There will always be a point when chasing trendy novel gameplay experiences becomes a detriment, but art can be great when it speaks to the times of its creation. Sega embraced this — for better and for worse — and Nintendo may be making its most inspired and exciting games in years by doing the same.</p><p>Or maybe Nintendo’s fans are helping to make the company cool; so much of the buzz around its modern games is based on funny gifs and fan-generated content from the games. Nintendo, in many ways, has gotten weird. And the fans are willing to get weird right back.</p><p>It took 27 years, but Ninten-does what Sega has always attempted. And that’s pretty cool.</p>",
            "afbeeldingl": "sanic-1.jpg",
            "afbeeldings": "sanic.jpg"
        }
    ]
}
